package org.kosmocourses.olga;

/**
 Во время подготовки к отлету в США сотрудники органов госбезопасности проверили багаж космонавтов и нашли книгу
 А. П. Чехова "Злоумышленник". Немного перестаравшись с исполнением досмотра, они решили заменить все
 вхождения слова «гайка» и его производных форм на «вырезано цензурой».Руководство постановило вам помочь сотрудникам
 органов сделать эту замену.
 Вы должны написать программу фильтрации контента книги. Для этого возьмите фрагмент из текста А. П. Чехова "Злоумышленник":
 ".
 ..
 Седьмого числа сего июля железнодорожный сторож Иван Семенов Акинфов,
 проходя утром по линии, на 141-й версте, застал тебя за отвинчиванием
 гайки, коей рельсы прикрепляются к шпалам. Вот она, эта гайка!.. С каковою
 гайкой он и задержал тебя. Так ли это было?
 — Чаво?
 — Так ли всё это было, как объясняет Акинфов?
 — Знамо, было.
 — Хорошо; ну, а для чего ты отвинчивал гайку?
 — Чаво?
 — Ты это свое «чаво» брось, а отвечай на вопрос! для чего ты отвинчивал
 гайку?
 — Коли б не нужна была, не отвинчивал бы, — хрипит Денис, косясь на
 потолок.
 — Для чего же тебе понадобилась эта гайка?
 — Гайка-то? Мы из гаек грузила делаем...
 — Кто это — мы?
 — Мы, народ... Климовские мужики, то есть.
 — Послушай, братец, не прикидывайся ты мне идиотом, а говори толком.
 Нечего тут про грузила врать!
 ..."
 Напишите метод, заменяющий в строке все вхождения слова «гайка» и его производных форм на «вырезано цензурой».
 Метод должен иметь сигнатуру: public String runCensor(String sourceText)
 *
 */
public class App 
{
    public static void main( String[] args )
    {
        System.out.println( "Hello World!" );
    }
}
