package org.kosmocourses.olga;

/**
 * Итак группа советских космонавтов вернулась из США. После приезда в СССР
 * ученые из академгородка решили снять мерки с космонавтов для изготовления
 * персональных скафандров “Сокол КВ-2” и посадочных кресел корабля
 * “Союз-МС”.
 * Ваша задача помочь ученым, напишите программу содержащую классы Astronaut
 * и Main.
 *
 * Подумайте какие поля и методы должен содержать класс Astronaut. Как
 * он должен выводиться на печать в “человеко читаемой” форме.
 *
 * В классе Main создайте такое количество инстансов классов Astronaut, так
 * чтобы полностью описать состав группы космонавтов.
 *
 * Напомню что в группе
 * прибывших советских космонавтов всего 6 человек, из них 3 человека основной
 * экипаж: командир, второй пилот, инженер (это вы) и 3 человека в дублирующем
 * составе
 *
 */
public class App 
{
    public static void main( String[] args )
    {
        Main.astroparameters();
    }
}
